{
    "Succès" : "Success",
    "Vérification de courriel complétée!" : "Email verification completed!",
    "Page d'accueil" : "Home page",


    "Détails pour le véhicule" : "Details for vehicle",
    "Propriétaire" : "Owner",
    "Marque" : "Brand",
    "Modèle" : "Model",
    "Plaque d'immatriculation" : "License plate",
    "Kilometrage" : "Kilometers",
    "Entrée créer le" : "Entry's creation date",
    "Dernière modification de l'entrée" : "Entry's last modification date",
    "Historique des réparations" : "Repair history",
    "Voir l'utilisateur" : "See owner's profile",
    "Modifier" : "Modify",
    "Supprimer" : "Delete",


    "Système de gestion des réparations automobiles" : "Automotive Repair Management System",
    "Ajouter un véhicule" : "Add a vehicle",
    "Aucune image disponible" : "Image not available",
    "Voir les détails" : "See details",


    "Modifier véhicule" : "Modify vehicle",
    "ID du propriétaire" : "Owner's ID",
    "Plaque d'immatriculation (format AAA 123)" : "License plate (format AAA 123)",
    "Photo du véhicule" : "Picture of the vehicle",
    "Enregistrer" : "Save",


    "Plaque immatriculation (format AAA 123)" : "License plate (format AAA 123)",


    "Détails pour l'utilisateur" : "Details for user",
    "Nom complet" : "Complete name",
    "Adresse" : "Address",
    "Âge" : "Age",
    "Numéro de téléphone" : "Phone number",
    "Courriel" : "Email",
    "Liste des véhicules" : "Vehicles list",


    "Détails pour la réparation" : "Details for repair",
    "Véhicule" : "Vehicle",
    "Date de début" : "Start date",
    "Date de fin" : "End date",
    "Description" : "Description",
    "Montant payé" : "Paid amount",
    "Mécanicien" : "Mechanic",
    "Voir le véhicule" : "See vehicle",
    

    "Ajouter une réparation" : "Add a repair",
    "Réparation" : "Repair",


    "Modifier réparation" : "Modify repair",
    "ID du véhicule" : "Vehicle ID",


    "Réparations" : "Repairs",
    "Véhicules" : "Vehicles",
    "Utilisateurs" : "Users",
    "Connexion" : "Login",
    "S'inscrire" : "Sign up",
    "Déconnexion" : "Logout",


    "Vérification d'adresse courriel" : "Email verification",
    "Un nouveau lien à été envoyé à votre adresse courriel." : "A new verification link has been sent to your email.",
    "Avant de continuer, veuillez consulter votre boîte à courriels pour un lien de vérification." : "Before continuing, please consult your emails for a verification link.",
    "Si vous n'avez pas reçu de lien" : "If you did not receive a link",
    "cliquez ici pour renvoyer un autre" : "click here to send a new one",


    "Inscription" : "Sign up",
    "Prénom" : "First name",
    "Nom" : "Last name",
    "Mot de passe" : "Password",
    "Confirmer le mot de passe" : "Confirm password",


    "Se souvenir de moi" : "Remember me",
    "Mot de passe oublié?" : "Forgot your password?",


    "Réinitialisation de mot de passe" : "Reset Password",
    "Réinitialisation le mot de passe" : "Reset my password",


    "Envoyer un lien de réinitialisation" : "Send Password Reset Link",
    "Veuillez confirmer votre mot de passe avant de continuer." : "Please confirm your password before continuing.",

    
    "À propos de ce projet" : "About this project",
    "Informations générales" : "General informations",
    "Site créer par" : "Website created by",
    "Cours" : "Class",
    "Applications Web transactionnelles" : "Transactional Web applications",
    "Session" : "Semester",
    "Automne" : "Fall",
    "Dépôt Github du projet" : "Github repository of the project",
    "Description du site et des fonctionalitées" : "Description of the Website and features",
    "Lorsque nous accédons au site, nous sommes demandés de nous connecter afin d'accéder au service. En haut à droite de la page, nous retrouvons le boutton S'inscrire' qui permet de se créer un compte. Une fois le compte créer, un nouvel utilisateur est créer dans la base de données et nous sommes redirigés vers la page de connexion. De plus, un lien de vérification est automatiquement envoyé au courriel entré afin de confirmer la création de compte" : "When we access the site, we are asked to log in in order to access the service. At the top right of the page, we find the 'Register' button which allows you to create an account. Once the account is created, a new user is created in the database and we are redirected to the login page. In addition, a verification link is automatically sent to the email entered to confirm the account creation",
    "Une fois le compte créer nous pouvons nous connecter. Il est possible de demander au site de garder notre session ouverte si la page est soudainement fermée. Il est important de noter qu'il sera impossible d'accéder aux pages tant et aussi longtemps que la vérification par email n'a été faite. Si c'est le cas, l'utilisateur sera redirigé vers une page qui permet de renvoyer un lien de vérification au besoin. Lorsque la vérification est complétée, les services seront accessibles" : "Once the account is created, we can log in. It is possible to ask the site to keep our session open if the page is suddenly closed. It is important to note that it will be impossible to access the pages until email verification has been done. If this is the case, the user will be redirected to a page that allows a verification link to be returned if needed. Once the audit is complete, services will be accessible",
    "Traduction" : "Translation",
    "Le site entier est traduit en anglais, français et espagnol ainsi que les messages d'erreur. Il est possible en tout temps d'utiliser le menu déroulant dans la barre de navigation afin de traduire la page sur laquelle on se trouve" : "The entire site is translated into English, French and Spanish as well as error messages. It is possible at any time to use the drop-down menu in the navigation bar to translate the page you are on",
    "Liste" : "List",
    "La page des réparations affiche toutes les réparations qui existent. Elle permet de cliquer sur chacune d'entre elles et de voir leur détails. Cette page contient également un bouton en haut à droite qui permet l'ajout d'une nouvelle réparation" : "The repairs page displays all the repairs that exist. It allows you to click on each of them and see their details. This page also contains a button at the top right that allows you to add a new repair",
    "Réparation spécifique" : "Specific repair",
    "Lorsque l'on clique sur une réparation spécifique, nous somme dirigés vers une page qui affiche les détails complets de celle-ci. De plus, on y trouve un boutton qui permet de visiter la page du véhicule sur lequel la réparation a été faite ainsi que deux bouttons qui permettent la modification et la suppression de cette réparation" : "When we click on a specific repair, we are directed to a page that displays the full details of it. In addition, there is a button that allows you to visit the page of the vehicle on which the repair was done as well as two buttons that allow you to modify and delete this repair",
    "Ajout" : "Add",
    "Cette page permet d'ajouter une nouvelle réparation pour un véhicule. Tout les champs sont requis" : "Use this page to add a new repair for a vehicle. All fields are required",
    "Modification" : "Modify",
    "Cette page permet de modifier les détails d'une réparation. Seuls les champs modifiés seront affectés" : "Use this page to edit the details of a repair. Only modified fields will be affected",
    "Supression" : "Delete",
    "Cette fonctionalité permet de supprimer une réparation" : "This feature allows you to delete a repair",
    "La page des véhicules affiche tous les véhicules qui existent avec leur image. Elle permet de cliquer sur chacun d'entre eux et de voir leur détails. Cette page contient également un bouton en haut à droite qui permet l'ajout d'un nouveau véhicule" : "The vehicles page displays all existing vehicles with their image. It allows you to click on each of them and see their details. This page also contains a button at the top right that allows you to add a new vehicle",
    "Véhicule spécifique" : "Specific vehicle",
    "Lorsque l'on clique sur un véhicule spécifique, nous somme dirigés vers une page qui affiche les détails complets de celui-ci. De plus, on y trouve un historique complet de toutes les réparations faites sur ce véhicule, un boutton qui permet de visiter la page de l'utilisateur propriétaire ainsi que deux bouttons qui permettent la modification et la suppression de ce véhicule" : "Lorsque l'on clique sur un véhicule spécifique, nous somme dirigés vers une page qui affiche les détails complets de celui-ci. De plus, on y trouve un historique complet de toutes les réparations faites sur ce véhicule, un boutton qui permet de visiter la page de l'utilisateur propriétaire ainsi que deux bouttons qui permettent la modification et la suppression de ce véhicule",
    "Cette page permet d'ajouter un nouveau véhicule pour un utilisateur. Tout les champs sont requis sauf celui de l'image. Si aucune photo n'est fourni, une image générique sera défini par défaut" : "This page allows you to add a new vehicle for a user. All fields are required except the one in the image. If no photo is provided, a generic image will be set by default",
    "Cette page permet de modifier les détails d'un véhicule. Seuls les champs modifiés seront affectés" : "Use this page to edit the details of a vehicle. Only modified fields will be affected",
    "Cette fonctionalitée permet de supprimer un véhicule" : "This feature allows you to delete a vehicle",
    "La page des utilisateurs affiche tous les utilisateurs qui existent. Elle permet de cliquer sur chacun d'entre eux et de voir leur détails. Cette page, contrairement aux autres, ne contient pas de bouton qui permet l'ajout d'un nouvel utilisateur puisque ceux-ci sont ajoutés à travers l'inscription au site" : "The users page displays all the users that exist. It allows you to click on each of them and see their details. This page, unlike the others, does not contain a button that allows the addition of a new user since these are added through the registration to the site",
    "Utilisateur spécifique" : "Specific user",
    "Lorsque l'on clique sur un utilisateur spécifique, nous somme dirigés vers une page qui affiche les détails complets de celui-ci. On y trouve également une liste des véhicules appartenant à cet utilisateur" : "When we click on a specific user, we are directed to a page that displays the full details of that user. There is also a list of vehicles owned by that user",
    "Comment utiliser le site" : "How to use the site",
    "Premièrement, créez-vous un compte avec le boutton s'inscrire dans la barre de navigation. Une fois cette étape de faite, vous pouvez vérifier dans vos emails pour un lien de vérification. Gardez en tête qu'à tout moment il est possible de traduire la page à l'aide du menu déroulant dans la barre de navigation. Une fois connecté, nous pouvons aller dans la section 'Véhicules' afin d'ajouter un véhicule avec le boutton en haut à droite. Il est possible de lui procurer une image ou de la laisser vide. Si aucune image n'est donnée, une image par défaut sera attribuée. Il est possible ensuite de cliquer sur le véhicule pour voir les détails, accéder au profil du propriétaire, voir la liste des réparations, modifier ou supprimer celui-ci. Ensuite, dans 'Réparation', on ajoute une nouvelle réparation à l'aide du boutton en haut à droite. Encore une fois, il est possible de voir les détails, accéder au véhicule sur lequel la réparation a été faite, modifier ou supprimer la réparation. Finalement, la même chose est possible dans la section 'Utilisateurs'" : "First, create an account with the button sign up in the navigation bar. Once this step is done, you can check your emails for a verification link. Keep in mind that at any time it is possible to translate the page using the drop-down menu in the navigation bar. Once logged in, we can go to the 'Vehicles' section in order to add a vehicle with the button at the top right. It is possible to give it an image or leave it blank. If no image is given, a default image will be assigned. It is then possible to click on the vehicle to see the details, access the owner's profile, see the list of repairs, modify or delete it. Then, in 'Repair', add a new repair using the button at the top right. Again, it is possible to view the details, access the vehicle on which the repair was made, modify or delete the repair. Finally, the same thing is possible in the 'Users' section",
    "Diagramme de la base de données" : "Database Diagram",
    "Base de données basée sur modèle" : "Model used for Database",
    "Voir le modèle complet" : "See the full model"
}